from aiogram import F
from aiogram.types import CallbackQuery, FSInputFile
from data.loader import rt, bot
from utils.db.api.user import DBuser
from utils.system.inline_btns import create_markup


@rt.callback_query(F.data == 'we')
async def profile2(call: CallbackQuery):
    if call.from_user.id in await DBuser.return_ban():
        await call.message.answer(f"Вы забанены!")
    else:
        name = await bot.get_me()
        await bot.delete_message(chat_id=call.from_user.id, message_id=call.message.message_id) ,
        markup = await create_markup('inline', [[['Наши отзывы', 'url.com']],
                                                [['👤 Поддержка', 'url.com']],
                                                [['Наш канал', 'url.com']],
                                                [["Назад", "back"]]])
        photo = FSInputFile(f"photo\daq.jpg", 'rb')
        await bot.send_photo(chat_id=call.from_user.id, photo=photo, caption=f"""<b>{name.first_name}</b> успешно работает на рынке электронных валют с 2021 года и за это время доказал свою эффективность как быстрый и удобный обменник в Telegram. Почему стоит выбирать нас?

 🏎 <b>Быстрота выполнения</b>
Все транзакции осуществляются в автоматическом режиме, со скоростью обработки от 15 до 20 минут после первого подтверждения.

📈 <b>Привлекательные курсы</b>
Мы предлагаем конкурентоспособные курсы без скрытых комиссий, и Вы получите точно такую сумму, которую видите при совершении обмена.

👤 <b>Конфиденциальность</b>
Мы не храним данные наших пользователей более 3-х дней. Все заявки анонимны и не передаются 3-им лицам. Мы работаем со всеми банками РФ.""", reply_markup=markup)
